app/controllers/api/v1/organizations_controller.rb

SELECT "organizations".* FROM "organizations" ORDER BY "organizations"."created_at" DESC
---
    scope = Organization.order(created_at: :desc)

INSERT INTO "organizations" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Apple"], ["created_at", "2018-01-27 21:38:00.756365"], ["updated_at", "2018-01-27 21:38:00.756365"]]
---
  def create
    organization = Organization.new organization_params

    if organization.save

DELETE FROM "organizations" WHERE "organizations"."id" = $1  [["id", 1]]
---
  def destroy
    if @organization.destroy

SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def find_organization
    @organization = Organization.find params[:id]