app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
  def index
    @users = User.order(created_at: :desc)

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at", "api_key") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    user = User.new(user_params)

    if user.save