app/controllers/api/v1/admin/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
  def index
    @users = User.order(created_at: :desc)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "is_admin" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["is_admin", "f"], ["updated_at", "2018-01-27 19:40:49.957685"], ["id", 7]]
---
  def toggle_admin
    @user = User.find(params[:id])
    @user.toggle!(:is_admin)